{
  "basics": {
    "name": "Robert “Jason” Kerney",
    "label": "Technical Coach / Programmer",
    "picture": "https://lh3.googleusercontent.com/-PhcInTMjUFs/SapDre47OOI/AAAAAAAABNY/KVkFm2hIeCU/s165/010_1046.JPG",
    "email": "jason@teamkerney.com",
    "phone": "",
    "website": "https://jason.teamkerney.com",
    "summary": "I first started programming in 1988 when he purchased a Commodore64 and learned Commodore Basic.  He quickly discovered that evenings and weekends disappeared. He has continued to pursue the field of programming with an ever-growing interest.\n\nI am a software engineer with more than 21 years of experience gained in a wide array of fields and projects. I enjoy the perspectives gained from work within new situations. My varied domains of work have allowed me a unique insight into the field of computer science.\n\nI hardworking, devoted professional who enjoys finding creative solutions to difficult problems. I enjoy passing on what I know to others through inspiration, teaching, mentoring, and coaching. I am frequently asked to speak at user groups and Code Camps. I was selected multiple times as a speaker to teach techniques that I developed to some of the best computer science engineers, and coaches, in the field at the US Agile Alliance Conferences.",
    "location": {
      "address": "",
      "postalCode": "92025",
      "city": "Escondido",
      "countryCode": "US",
      "region": "CA"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "@JasonKerney",
        "url": "https://twitter.com/JasonKerney"
      },
      {
        "network": "Linked In",
        "username": "In: Jason Kerney",
        "url": "https://www.linkedin.com/in/jasonkerney/"
      },
      {
        "network": "Git Hub",
        "username": "Jason Kerney",
        "url": "https://github.com/jason-kerney/"
      },
      {
        "network": "NPM",
        "username": "jasonkerney",
        "url": "https://www.npmjs.com/~jasonkerney"
      },
      {
        "network": "Nuget",
        "username": "JasonKerney",
        "url": "https://www.nuget.org/profiles/JasonKerney"
      }
    ]
  },
  "work": [
    {
      "company": "Hunter Industries",
      "position": "Full Stack Engineer",
      "website": "http://www.hunterindustries.com/",
      "startDate": "2014-01-06",
      "summary": "Hunter Industries is a worldwide organization providing irrigation, landscape lighting and custom molding. Their attention to quality combined with their drive for innovation has kept them as one of the top performers in their industry. I have worked to help make their programming efforts world renowned by teaching, coaching and mentoring practices that keep their bug count to zero and their time to market unbeatable.",
      "highlights": [
        "Spends a quarter of his time coaching technical skills",
        "Reworked the department's onboarding",
        "Reworked the department's employee growth and feedback system",
        "Coaches around continual growth in technical and interpersonal skills",
        "Runs training sessions on technical practices and ideas",
        "Trained another department in using interpersonal tools to increase safety around their communications",
        "Helped start an internal user group to spread knowledge about beneficial software practices used through-out the company",
        "Coaches Retrospectives",
        "Leads Retrospectives"
      ]
    },
    {
      "company": "BACTES Inc.",
      "position": "Scrum Master, Senior Programmer",
      "website": "http://www.bactes.com/",
      "startDate": "2011-05-02",
      "endDate": "2013-12-20",
      "summary": "",
      "highlights": [
        "Coached in Agile principles and practices",
        "Lead Retrospectives",
        "Coached on Retrospectives",
        "Moved to daily, bug free, deployments.",
        "Delivered in 3 moths a system that had not been delivered in 3 years.",
        "Built a history of bug free releases",
        "Trained team in XP practices",
        "Trained XP practice of \"Test Driven Developmen\"",
        "Trained XP practice of \"Pair Programming\"",
        "Trained XP practice of \"Automated Deployment\"",
        "Trained XP practice of \"Customer Focus\"",
        "Hired team of developers to work on legacy bug-ridden system.",
        "Helped with initial guidance on their Agile transformation"
      ]
    },
    {
      "company": "Neodigm Inc.",
      "position": "Co-Founder",
      "website": "",
      "startDate": "2010-08-01",
      "endDate": "2011-05-02",
      "summary": "Neodigm was dedicated to helping impoverished cities by partnering with Schools to write educational grants. These grants tended to focus on professional development for teachers teaching in those school districts. I was taking my technical understanding to train grant writers in the practices used to make successful software. Through these techniques Neodigm became the leader in their industry with some of the highest success rates among grant writers and teams.",
      "highlights": [
        "Used skills and tools from software development to allow our team of grant writers to have one of the highest success rates in the nation.",
        "Used concepts from Agile and Lean Development to guide our teams to working very effectively together."
      ]
    },
    {
      "company": "Airgain Inc.",
      "position": "Senior Software Engineer",
      "website": "http://www.airgain.com/",
      "startDate": "2008-07-01",
      "endDate": "2011-05-02",
      "summary": "Airgain makes high quality embedded wireless antennas. These antennas are rigorously tested and compared to ensure only the best designs are sold. Airgain is dedicated innovation in the field which makes them one of most competitive manufactures. I was asked to train a software development team working in embedded systems in software development patterns and testing.",
      "highlights": [
        "Trained the team in the use of common Object-Oriented patterns which improved time to delivery",
        "Helped design an automated test system for testing of hardware",
        "Helped design an embedded driver for their wireless antenna’s that reduced dropped packets"
      ]
    },
    {
      "company": "irdeto",
      "position": "Senior Software Engineer",
      "website": "http://www.irdeto.com/",
      "startDate": "2006-09-01",
      "endDate": "2008-07-01",
      "summary": "irdeto provides software and hardware solutions to media and media distribution companies. I performed as a lead developer and was tasked with writing the most crucial and sensitive parts of the system.",
      "highlights": [
        "Designed and implemented the billing engine for a Customer Sales, Promotions, and Billing product aimed at cable providers",
        "Designed and implemented the security architecture for a Customer Sales, Promotions, and Billing product aimed at cable providers",
        "Part of the “Fire Fighter” team that had a mandated 24-hour turnaround time for critical bugs discovered in a Customer Sales, Promotions, and Billing product aimed at cable providers. This product was developed by over 30 programmers, and the firefighting team was often working on code they had never seen before",
        "Designed a new way to put legacy code under unit test"
      ]
    },
    {
      "company": "SEIDCON Inc",
      "position": "Information Assurance Security & Senior Applications Engineer",
      "website": "http://www.seidcon.com/",
      "startDate": "1998-01-01",
      "endDate": "2006-09-01",
      "summary": "SEIDCON Inc. is dedicated to being in the fore front of digital security. They provide an outside consultancy to government agencies providing everything from penetration testing to the design of physical locations that prevent signal leakage. I started out as a Junior Programmer and quickly proved to be so much more by understanding the business and finding inefficiencies that software can fix. My efforts made the company so successful that their competitors found it was cheaper to sublet the work to SEIDCON rather than doing it themselves.",
      "highlights": [
        "Designed, prototyped, and demonstrated a way to automate a cumbersome part of the service they provide",
        "Responsible for reviewing development technologies and determining their use within the company",
        "Helped with performing security evaluations of US Military Base and Naval vessel IT infrastructure",
        "Trained a junior programmer in new programming language, tools, and successful methodologies"
      ]
    },
    {
      "company": "Industrial Development Studios",
      "position": "Application Engineer",
      "website": "",
      "startDate": "1997-01-01",
      "endDate": "1997-10-01",
      "summary": "Industrial Development Studios was a startup dedicated to automating manufacturing facilities. They entered a company seeking to understand their workflows and needs, then proposed robotic modifications to assembly lines. I was challenged here by having to deal with rapidly changing technologies, programming languages and environments. Also I was expected to be part of the sales force and deal directly with potential as well as actual customers.",
      "highlights": [
        "Participated in sales pitches and sales demonstrations",
        "Ran customer demonstrations",
        "Helped develop systems to automate factories in multiple languages designed by hardware vendors"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Society for Creative Anachronism (SCA), Barony of Calafia",
      "position": "Youth Officer",
      "website": "http://www.calafia.org/",
      "startDate": "2014-09-01",
      "endDate": "2015-06-01",
      "summary": "Group dedicated to the promotion of Medieval history.",
      "highlights": [
        "Responsible for coordinating, overseeing and organizing youth events intended to excite and educate."
      ]
    }
  ],
  "education": [
    {
      "institution": "ITT Technical Institute",
      "area": "Electrical and Electronics Engineering",
      "studyType": "Bachelor",
      "startDate": "1994-01-01",
      "endDate": "1998-01-01"
    }
  ],
  "publications": [
    {
      "name": "Experience Report: Mob Programming - My First Team",
      "publisher": "Agile Aliance",
      "releaseDate": "2015-05-08",
      "website": "https://www.agilealliance.org/resources/experience-reports/mob-programming-my-first-team/",
      "summary": "What was it like joing a mob programming team. I had problems, my ego got in my way. I also learned a lot about myself, and inproved my out of work relationships."
    }
  ],
  "awards": [
    {
      "title": "Speaker at Agile Alliance Conference : Facilitating Success Without Unicorns",
      "date": "2017-06-18",
      "awarder": "Agile Alliance",
      "summary": "The Agile Alliance Conference is a highly competitive conference to speak at. This conference is dedicated to the promotion and education about Agile practices primarily in software development."
    },
    {
      "title": "Speaker at Agile Alliance Conference : Mob Programming - My First Team",
      "date": "2015-08-03",
      "awarder": "Agile Alliance",
      "summary": "The Agile Alliance Conference is a highly competitive conference to speak at. This conference is dedicated to the promotion and education about Agile practices primarily in software development."
    },
    {
      "title": "Speaker at Agile Alliance Conference : Tackling Legacy Code",
      "date": "2014-07-28",
      "awarder": "Agile Alliance",
      "summary": "The Agile Alliance Conference is a highly competitive conference to speak at. This conference is dedicated to the promotion and education about Agile practices primarily in software development."
    },
    {
      "title": "Speaker at Agile Alliance Conference : The Worst of Legacy Code - Forensic Development",
      "date": "2010-08-13",
      "awarder": "Agile Alliance",
      "summary": "The Agile Alliance Conference is a highly competitive conference to speak at. This conference is dedicated to the promotion and education about Agile practices primarily in software development."
    }
  ],
  "skills": [
    {
      "name": "Technical Coaching",
      "level": "Master",
      "keywords": [
        "Agile",
        "XP",
        "Mob Programming",
        "Pair Programming",
        "Retrospectives",
        "Programming Practice (Katas)",
        "Test Driven Development (TDD)",
        "Behavior Driven Development (BDD)",
        "Code Smells",
        "Legacy Code Remediation",
        "Functional Programming",
        "Object Oriented Programming",
        "Functional Programming",
        "Programming Languages"
      ]
    },
    {
      "name": "Software Development",
      "level": "Master",
      "keywords": [
        "SOLID",
        "Test Driven Development (TDD)",
        "Behavior Driven Development (BDD)",
        "Legacy Code Remediation",
        "ANSI SQL",
        "Data Normalization",
        "Functional Programming",
        "Object Oriented Programming"
      ]
    },
    {
      "name": "C#",
      "level": "Master",
      "keywords": [
        "Backend Development",
        "Linq",
        "Nuget",
        "1.0 through 7.0"
      ]
    },
    {
      "name": "F#",
      "level": "Intermediate",
      "keywords": []
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Writing",
      "keywords": [
        "Fiction"
      ]
    },
    {
      "name": "My Kids",
      "keywords": [
        "Teaching Programming",
        "Sports",
        "Teaching",
        "School"
      ]
    },
    {
      "name": "Programming",
      "keywords": [
        "New Languages",
        "Functional",
        "Teaching",
        "Mentoring",
        "Learning"
      ]
    },
    {
      "name": "Open Source Development",
      "keywords": [
        "Testing Frameworks",
        "Type Systems",
        "JavaScript",
        "C#",
        "F#"
      ]
    }
  ],
  "references": [
    {
      "name": "Woody Zuill",
      "reference": "Jason is a great programmer and has a real passion for process improvement and extreme programming practices. He always puts in full effort, and still finds time to work at making things better. He goes above and beyond what is expected of him and is always willing to help anyone who asks for his assistance."
    },
    {
      "name": "Chris van Hammersveld",
      "reference": "Jason is a detail-oriented engineer who focuses on the process of how to complete a project. He brought Agile development to Airgain and implemented it on several projects. He was respected by his peers and always had a good attitude."
    },
    {
      "name": "William Getz",
      "reference": "I have studied under Jason for about one years time now, and his methodology of instruction is clear and creative. Jason is able to instruct both basic and advanced concepts in programming as well as Agile and Test Driven Development. I have learned a great deal from him, and look forward to learning more from him as the years progress."
    }
  ]
}